In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('features_attributes.csv')

In [3]:
df.head()

  Customer_ID            Name Age          SSN     Occupation snapshot_date
0  CUS_0x1000  Alistair Barrf  18  913-74-1218         Lawyer    2023-05-01
1  CUS_0x1009          Arunah  26  063-67-6938       Mechanic    2025-01-01
2  CUS_0x100b        Shirboni  19    #F%$D@*&8  Media_Manager    2024-03-01
3  CUS_0x1011       Schneyerh  44  793-05-8223         Doctor    2023-11-01
4  CUS_0x1013        Cameront  44  930-49-9615       Mechanic    2023-12-01

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12500 entries, 0 to 12499
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_ID    12500 non-null  object
 1   Name           12500 non-null  object
 2   Age            12500 non-null  object
 3   SSN            12500 non-null  object
 4   Occupation     12500 non-null  object
 5   snapshot_date  12500 non-null  object
dtypes: object(6)
memory usage: 586.1+ KB

In [5]:
df['Customer_ID'].is_unique

True

In [6]:
# age
# Step 1: Remove underscores from Age column
df['Age'] = df['Age'].str.replace('_', '', regex=False)
# Step 2: Convert to numeric (integer), coercing errors to NaN
df['Age'] = pd.to_numeric(df['Age']).astype('int64')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12500 entries, 0 to 12499
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_ID    12500 non-null  object
 1   Name           12500 non-null  object
 2   Age            12500 non-null  int64
 3   SSN            12500 non-null  object
 4   Occupation     12500 non-null  object
 5   snapshot_date  12500 non-null  object
dtypes: int64(1), object(5)
memory usage: 586.1+ KB

In [8]:
# SSN
import re
# Regex pattern for valid SSNs
ssn_pattern = re.compile(r'^\d{3}-\d{2}-\d{4}$')
# Replace invalid SSNs with the string "none"
df['SSN'] = df['SSN'].apply(lambda x: x if ssn_pattern.match(str(x)) else "Unknown")

In [9]:
df.head()

  Customer_ID            Name  Age          SSN     Occupation snapshot_date
0  CUS_0x1000  Alistair Barrf   18  913-74-1218         Lawyer    2023-05-01
1  CUS_0x1009          Arunah   26  063-67-6938       Mechanic    2025-01-01
2  CUS_0x100b        Shirboni   19      Unknown  Media_Manager    2024-03-01
3  CUS_0x1011       Schneyerh   44  793-05-8223         Doctor    2023-11-01
4  CUS_0x1013        Cameront   44  930-49-9615       Mechanic    2023-12-01

In [10]:
# Occupation
df['Occupation'] = df['Occupation'].replace('_______', 'Unemployed')

In [11]:
df.head()

  Customer_ID            Name  Age          SSN     Occupation snapshot_date
0  CUS_0x1000  Alistair Barrf   18  913-74-1218         Lawyer    2023-05-01
1  CUS_0x1009          Arunah   26  063-67-6938       Mechanic    2025-01-01
2  CUS_0x100b        Shirboni   19      Unknown  Media_Manager    2024-03-01
3  CUS_0x1011       Schneyerh   44  793-05-8223         Doctor    2023-11-01
4  CUS_0x1013        Cameront   44  930-49-9615       Mechanic    2023-12-01

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12500 entries, 0 to 12499
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_ID    12500 non-null  object
 1   Name           12500 non-null  object
 2   Age            12500 non-null  int64
 3   SSN            12500 non-null  object
 4   Occupation     12500 non-null  object
 5   snapshot_date  12500 non-null  object
dtypes: int64(1), object(5)
memory usage: 586.1+ KB